:PROPERTIES:
:ID: 3CC3A006-31A6-424F-8176-A1BA8CA9A2B5
:END:
#+title: Help
#+description: Help
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:countries:
#+created: 2026-05-21
#+updated: 2026-06-25

#+name: help-countries-exit
#+begin_src ores-shell :exports none
countries
help
exit
exit
#+end_src

#+begin_src sh :noweb yes :results output :wrap example
printf 'countries\nhelp\nexit\nexit\n' | ./compass.sh shell -u 'tenant_admin@barclays_plc' -p 'Secure-Password-123' 2>&1
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to nats://localhost:42230
✓ Logged in as: tenant_admin
  Tenant:  (36d4c3c9-195c-46b5-a4d8-b36cb48c8f46)
ORE Studio Shell REPL v0.0.21
Type 'help' for available commands, 'exit' to quit.

ores-shell> countries> Commands available:
 - help
	This help message
 - exit
	Quit the session
 - history
	Show the history
 - ! <history entry index>
	Exec a command by index in the history
 - get
	Retrieve countries from the server (paginated)
 - add <string> <string> <string> <string> <string> <string> <string>
	Add a country (alpha2 alpha3 numeric name official_name reason_code "commentary")
 - delete <string>
	Delete a country by alpha-2 code
 - history <string>
	Get version history for a country by alpha-2 code
 - ores-shell
	(menu)
countries> Bye!
#+end_example
